blog/EqualityOfFunctions/EqualityOfFunctions.lagda.org
#+Title: Equality of functions in Agda
#+Author: Mark Armstrong
#+Date: January 21st, 2020
#+Description: Answering a question; when can we say two functions
#+Description: are equal in Agda?
#+Startup: noindent
#+Setupfile: ./../../theme-readtheorg.setup
#+Property: header-args:agda2 :tangle src/EqualityOfFunctions.agda
#+Export_file_name: ../EqualityOfFunctions

* Introduction
  :PROPERTIES:
  :CUSTOM_ID: Introduction
  :END:

** Preamble                                     :ignore:

A student fairly new to Agda recently asked me:
#+begin_quote
We've discussed that addition is defined by two properties;
- ~zero + n = n~, and
- ~(suc n) + m = suc (n + m)~.

In Agda, can we prove a function is equal to addition
if it satisfies these properties?

More generally, without knowledge of such properties,
can we prove one function is equal to another?
#+end_quote

Let's explore this topic a little bit.
For simplicity, we'll restrict our attention to just
unary and binary functions between natural numbers.

An important first step is deciding: what do we mean by
“equal” when we say that
“one function is equal to another”?

** Extensional or intensional
   :PROPERTIES:
   :CUSTOM_ID: Extensional-or-intensional
   :END:

For a better discussion of intensional versus extensional equality
than I can pen, we can turn to Paul Taylor's
“[[https://www.paultaylor.eu/~pt/prafm/][Practical foundations of mathematics]]”.
.
#+begin_quote
For Leonhard Euler (1748) and most mathematicians up to the end of
the nineteenth century, a function was an expression formed using the
arithmetical operations and transcendental operations such as ~log~. The
modern /infor/-matician would take a similar view, but would be more
precise about the method of formation (algorithm). Two such functions
are equal if this can be shown from the laws they are known to obey.

However, during the twentieth century mathematics students have been
taught that a function is a set of input-output pairs. The only condition
is that for each input value there /exists/, somehow, an output value, which
is /unique/. This is the *graph* of the function: plotting output values in the
/y/-direction against arguments along the /x/-axis, forgetting the algorithm.
Now two functions are equal if they have the same output value for each
input. (This definition was proposed by Peter Lejeune Dirichlet in 1829,
but until 1870 it was thought to be far too general to be useful).

These definitions capture the /intension/ and the effect (/extension/) of a
function.
#+end_quote

So we must be careful /which/ notion of equality we are using during
our discussion below.
We will [[⊕ does not equal + intensionally][demonstrate]]
that we cannot in general prove functions are intensionally equal in Agda.

* Agda header                                   :noexport:
  :PROPERTIES:
  :CUSTOM_ID: Agda-header
  :END:

#+begin_src agda2
module EqualityOfFunctions where
#+end_src

* Equality in Agda
  :PROPERTIES:
  :CUSTOM_ID: Equality-in-Agda
  :END:

** Preamble                                     :ignore:

We will use the Agda standard library definitions of the natural numbers,
addition, and /propositional equality/ in this discussion,
along with equational reasoning for proofs.
#+begin_src agda2
open import Data.Nat using (ℕ ; zero ; suc ; _+_)

import Relation.Binary.PropositionalEquality as Eq
open Eq using (_≡_ ; refl)
open Eq.≡-Reasoning using (begin_ ; _≡⟨⟩_ ; _≡⟨_⟩_ ; _∎)
#+end_src

** Mechanics of propositional equality
   :PROPERTIES:
   :CUSTOM_ID: Mechanics-of-propositional-equality
   :END:

Propositional equality is defined by just one constructor (rule), ~refl~.
~refl~ tells us that any entity is equal to itself.
So, for instance, ~zero ≡ zero~ and ~suc (suc zero) ≡ suc (suc zero)~.

Given this definition, it might be a bit surprising that,
for instance, ~zero + zero ≡ zero~.
Such equalities hold because Agda /normalises/ terms during typechecking.
By the definition of addition, ~zero + zero~ normalises to ~zero~,
and so ~zero + zero ≡ zero~ normalises to ~zero ≡ zero~, which is inhabited
by ~refl~.

** Intensional equality
   :PROPERTIES:
   :CUSTOM_ID: Intensional-equality
   :END:

Propositional equality is an intensional equality, as noted in the comment
at the top of ~Relation.Binary.PropositionalEquality~:
#+begin_example agda2
------------------------------------------------------------------------
-- The Agda standard library
--
-- Propositional (intensional) equality
------------------------------------------------------------------------
#+end_example

Indeed, propositional equality is intentional; two entities are only
propositionally equal if their normal forms are defined the same way
(from the constructors of their type).

Hence, we will say that say that
two (Agda) functions ~f~ and ~g~ are /intensionally/ equal
if we can prove that ~f ≡ g~.

** Extensional equality
   :PROPERTIES:
   :CUSTOM_ID: Extensional-equality
   :END:

We will use propositional (intensional) equality in order to define
extensional equality in Agda.

We will call two Agda functions ~f~ and ~g~ of type ~A → B~ extensionally equal
if we can prove ~(x : A) → f x ≡ g x~. Note we could write a ~∀~ explicitly,
as in ~∀ (x : A) → f x ≡ g x~, but it is not necessary and we will omit it.

Since we are dealing with binary (curried) functions on the naturals,
extensional equality below will specifically mean ~(m n : ℕ) → f m n ≡ g m n~.

