blog/EqualityOfFunctions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-14 Fri 13:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Equality of functions in Agda</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mark Armstrong" />
<meta name="description" content="Answering a question; when can we say two functions
are equal in Agda?"
 />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Equality of functions in Agda</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#Introduction">1. Introduction</a>
<ul>
<li><a href="#Extensional-or-intensional">1.1. Extensional or intensional</a></li>
</ul>
</li>
<li><a href="#Equality-in-Agda">2. Equality in Agda</a>
<ul>
<li><a href="#Mechanics-of-propositional-equality">2.1. Mechanics of propositional equality</a></li>
<li><a href="#Intensional-equality">2.2. Intensional equality</a></li>
<li><a href="#Extensional-equality">2.3. Extensional equality</a></li>
</ul>
</li>
<li><a href="#Setup">3. Setup</a></li>
<li><a href="#⊕-equals-+…-extensionally">4. ⊕ equals +… extensionally</a></li>
<li><a href="#An-example">5. An example</a></li>
<li><a href="#⊕-does-not-equal-+-intensionally">6. ⊕ does not equal + intensionally</a>
<ul>
<li><a href="#Well,-actually…">6.1. Well, actually…</a></li>
</ul>
</li>
<li><a href="#The-general-case">7. The general case</a></li>
<li><a href="#Inequality">8. Inequality</a></li>
<li><a href="#Further-reading">9. Further reading</a></li>
<li><a href="#About-this-document">10. About this document</a></li>
</ul>
</div>
</div>

<div id="outline-container-org915445e" class="outline-2">
<h2 id="Introduction"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-Introduction">
<p>
A student fairly new to Agda recently asked me:
</p>
<blockquote>
<p>
We've discussed that addition is defined by two properties;
</p>
<ul class="org-ul">
<li><code>zero + n = n</code>, and</li>
<li><code>(suc n) + m = suc (n + m)</code>.</li>
</ul>

<p>
In Agda, can we prove a function is equal to addition
if it satisfies these properties?
</p>

<p>
More generally, without knowledge of such properties,
can we prove one function is equal to another?
</p>
</blockquote>

<p>
Let's explore this topic a little bit.
For simplicity, we'll restrict our attention to just
unary and binary functions between natural numbers.
</p>

<p>
An important first step is deciding: what do we mean by
“equal” when we say that
“one function is equal to another”?
</p>
</div>

<div id="outline-container-orge1218d0" class="outline-3">
<h3 id="Extensional-or-intensional"><span class="section-number-3">1.1</span> Extensional or intensional</h3>
<div class="outline-text-3" id="text-Extensional-or-intensional">
<p>
For a better discussion of intensional versus extensional equality
than I can pen, we can turn to Paul Taylor's
“<a href="https://www.paultaylor.eu/~pt/prafm/">Practical foundations of mathematics</a>”.
.
</p>
<blockquote>
<p>
For Leonhard Euler (1748) and most mathematicians up to the end of
the nineteenth century, a function was an expression formed using the
arithmetical operations and transcendental operations such as <code>log</code>. The
modern <i>infor</i>-matician would take a similar view, but would be more
precise about the method of formation (algorithm). Two such functions
are equal if this can be shown from the laws they are known to obey.
</p>

<p>
However, during the twentieth century mathematics students have been
taught that a function is a set of input-output pairs. The only condition
is that for each input value there <i>exists</i>, somehow, an output value, which
is <i>unique</i>. This is the <b>graph</b> of the function: plotting output values in the
<i>y</i>-direction against arguments along the <i>x</i>-axis, forgetting the algorithm.
Now two functions are equal if they have the same output value for each
input. (This definition was proposed by Peter Lejeune Dirichlet in 1829,
but until 1870 it was thought to be far too general to be useful).
</p>

<p>
These definitions capture the <i>intension</i> and the effect (<i>extension</i>) of a
function.
</p>
</blockquote>

<p>
So we must be careful <i>which</i> notion of equality we are using during
our discussion below.
We will <a href="#⊕-does-not-equal-+-intensionally">demonstrate</a>
that we cannot in general prove functions are intensionally equal in Agda.
</p>
</div>
</div>
</div>

<div id="outline-container-org867818c" class="outline-2">
<h2 id="Equality-in-Agda"><span class="section-number-2">2</span> Equality in Agda</h2>
<div class="outline-text-2" id="text-Equality-in-Agda">
<p>
We will use the Agda standard library definitions of the natural numbers,
addition, and <i>propositional equality</i> in this discussion,
along with equational reasoning for proofs.
</p>
<div class="org-src-container">
<pre class="src src-agda2">open import Data.Nat using <span style="color: #51afef;">(</span>&#8469; ; zero ; suc ; _+_<span style="color: #51afef;">)</span>

import Relation.Binary.PropositionalEquality as Eq
open Eq using <span style="color: #51afef;">(</span>_&#8801;_ ; refl<span style="color: #51afef;">)</span>
open Eq.&#8801;-Reasoning using <span style="color: #51afef;">(</span>begin_ ; _&#8801;<span style="color: #C57BDB;">&#10216;&#10217;</span>_ ; _&#8801;<span style="color: #C57BDB;">&#10216;</span>_<span style="color: #C57BDB;">&#10217;</span>_ ; _&#8718;<span style="color: #51afef;">)</span>
</pre>
</div>
</div>

<div id="outline-container-orgb389baa" class="outline-3">
<h3 id="Mechanics-of-propositional-equality"><span class="section-number-3">2.1</span> Mechanics of propositional equality</h3>
<div class="outline-text-3" id="text-Mechanics-of-propositional-equality">
<p>
Propositional equality is defined by just one constructor (rule), <code>refl</code>.
<code>refl</code> tells us that any entity is equal to itself.
So, for instance, <code>zero ≡ zero</code> and <code>suc (suc zero) ≡ suc (suc zero)</code>.
</p>

<p>
Given this definition, it might be a bit surprising that,
for instance, <code>zero + zero ≡ zero</code>.
Such equalities hold because Agda <i>normalises</i> terms during typechecking.
By the definition of addition, <code>zero + zero</code> normalises to <code>zero</code>,
and so <code>zero + zero ≡ zero</code> normalises to <code>zero ≡ zero</code>, which is inhabited
by <code>refl</code>.
</p>
</div>
</div>

<div id="outline-container-org0a707bf" class="outline-3">
<h3 id="Intensional-equality"><span class="section-number-3">2.2</span> Intensional equality</h3>
<div class="outline-text-3" id="text-Intensional-equality">
<p>
Propositional equality is an intensional equality, as noted in the comment
at the top of <code>Relation.Binary.PropositionalEquality</code>:
</p>
<pre class="example">
------------------------------------------------------------------------
-- The Agda standard library
--
-- Propositional (intensional) equality
------------------------------------------------------------------------
</pre>

<p>
Indeed, propositional equality is intentional; two entities are only
propositionally equal if their normal forms are defined the same way
(from the constructors of their type).
</p>

<p>
Hence, we will say that say that
two (Agda) functions <code>f</code> and <code>g</code> are <i>intensionally</i> equal
if we can prove that <code>f ≡ g</code>.
</p>
</div>
</div>

<div id="outline-container-org0745b60" class="outline-3">
<h3 id="Extensional-equality"><span class="section-number-3">2.3</span> Extensional equality</h3>
<div class="outline-text-3" id="text-Extensional-equality">
<p>
We will use propositional (intensional) equality in order to define
extensional equality in Agda.
</p>

<p>
We will call two Agda functions <code>f</code> and <code>g</code> of type <code>A → B</code> extensionally equal
if we can prove <code>(x : A) → f x ≡ g x</code>. Note we could write a <code>∀</code> explicitly,
as in <code>∀ (x : A) → f x ≡ g x</code>, but it is not necessary and we will omit it.
</p>

<p>
Since we are dealing with binary (curried) functions on the naturals,
extensional equality below will specifically mean <code>(m n : ℕ) → f m n ≡ g m n</code>.
</p>
</div>
</div>
</div>
