blog/EqualityOfFunctions/EqualityOfFunctions.lagda.org
* Setup
  :PROPERTIES:
  :CUSTOM_ID: Setup
  :END:

Here we make use of the following definitions from the standard library.
#+begin_src agda2
open import Data.Nat using (ℕ ; zero ; suc ; _+_)
open import Data.Nat.Properties using (+-identityʳ)
open import Data.Product using (_,_ ; uncurry)
open import Relation.Nullary using (¬_)
import Relation.Binary.PropositionalEquality as Eq
open Eq using (_≡_ ; refl ; sym ; cong ; cong-app)
open Eq.≡-Reasoning using (begin_ ; _≡⟨⟩_ ; _≡⟨_⟩_ ; _∎)
#+end_src

For the purposes of this thought experiment, we will work with
this Agda record.
#+begin_example agda2
record PseudoAddition : Set where
  field
    _⊕_ : ℕ → ℕ → ℕ
    z⊕n≡n : (n : ℕ) → zero ⊕ n ≡ n
    [suc-m]⊕n≡suc-[m⊕n] : (m n : ℕ) → (suc m) ⊕ n ≡ suc (m ⊕ n)
#+end_example

We call the record ~PseudoAddition~, since we are claiming that the ~⊕~ operator
is, in fact, addition, even though we do not have its definition.
Practically speaking, this means we have as assumptions
the existence of this ~⊕~ operator
and the two properties describing its behaviour.

We could equivalently have made the fields parameters to this Agda module;
in Agda, records define a module, so there's not much difference.

* ⊕ equals +… extensionally
  :PROPERTIES:
  :CUSTOM_ID: ⊕-equals-+…-extensionally
  :END:

It's relatively simple to prove that our assumed ~⊕~ operator
is extensionally equal to addition, given
the properties ~zero ⊕ n ≡ n~ and ~m ⊕ n ≡ m + n~.
Enough so that we leave this as exercise to the reader.
Make use of ~cong~ in the induction step; you'll probably need just two steps.
#+begin_src agda2
record PseudoAddition : Set where
  field
    _⊕_ : ℕ → ℕ → ℕ
    z⊕n≡n : (n : ℕ) → zero ⊕ n ≡ n
    [suc-m]⊕n≡suc-[m⊕n] : (m n : ℕ) → (suc m) ⊕ n ≡ suc (m ⊕ n)

  m⊕n≡m+n : (m n : ℕ) →  m ⊕ n ≡ m + n
  m⊕n≡m+n zero n = z⊕n≡n n
  m⊕n≡m+n (suc m) n =
    begin
      (suc m ⊕ n)
    ≡⟨ [suc-m]⊕n≡suc-[m⊕n] m n ⟩
      suc (m ⊕ n)
    ≡⟨ cong suc (m⊕n≡m+n m n) ⟩
      suc (m + n)
    ∎
#+end_src

* An example
  :PROPERTIES:
  :CUSTOM_ID: An-example
  :END:

Let's take a short break here to see an actual use of our record;
we can define an operator similar, but not quite equal to addition,
and by providing proofs that it satisfies the two properties
defining plus, the record provides us with a proof that our operator
is extensionally equal to addition.
(Note the
[[https://agda.readthedocs.io/en/v2.6.0.1/language/instance-arguments.html#defining-type-classes][connection]]
between Agda records and Haskell-style typeclasses).
#+begin_src agda2
_+′_ : ℕ → ℕ → ℕ
m +′ n = m + n + 0

+′-is-PseudoAddition : PseudoAddition
+′-is-PseudoAddition =
  record { _⊕_ = _+′_
         ; z⊕n≡n = +-identityʳ
         ; [suc-m]⊕n≡suc-[m⊕n] = λ _ _ → refl }

m+′n≡m+n : (m n : ℕ) → m +′ n ≡ m + n
m+′n≡m+n = PseudoAddition.m⊕n≡m+n +′-is-PseudoAddition
#+end_src

* ⊕ does not equal + intensionally
  :PROPERTIES:
  :CUSTOM_ID: ⊕-does-not-equal-+-intensionally
  :END:

So, we can show prove that our operation is extensionally equal to addition.
However, if we try to prove
#+begin_example agda2
  ⊕≡+ : _⊕_ ≡ _+_
  ⊕≡+ = ?
#+end_example
we will find we cannot. (Note we cannot disprove it either).

In fact, even if we know the definition of the operator,
and that definition is /exactly the same/ as that of addition, as in
#+begin_src agda2
_+″_ : ℕ → ℕ → ℕ
zero  +″ n = n
suc m +″ n = suc (m +″ n)
#+end_src
we *still* cannot prove it is intensionally equal to addition.

*Why not!?*

A [[https://lists.chalmers.se/pipermail/agda/2015/007492.html][post]]
by Peter Selinger on the Agda mailing list sheds some light on the situation.
Specifically, he sums up the situation as
#+begin_quote
…function equality in Agda is definitional
equality, i.e., two functions are equal if and only if they are
internally represented as pointers to the same closure.
#+end_quote

** Well, actually…
   :PROPERTIES:
   :CUSTOM_ID: Well,-actually…
   :END:

There is small a gotcha here; this statement applies
to functions /defined by pattern matching/.
Functions not defined by pattern matching are simply abbreviations,
and those abbreviations are expanded during equality checks.
See the later [[https://lists.chalmers.se/pipermail/agda/2015/007497.html][post]]
in the same thread by Andreas Abel.

So, this code will typecheck.
#+begin_src agda2
_+‴_ : ℕ → ℕ → ℕ
m +‴ n = m + n

+‴≡+ : _+‴_ ≡ _+_
+‴≡+ = refl
#+end_src

* The general case
  :PROPERTIES:
  :CUSTOM_ID: The-general-case
  :END:

Given what we've seen above with ~⊕~ and addition, we can conclude
this about checking equality of functions in Agda:
- We can, given enough information, prove that two functions are
  /extensionally/ equal to each other (~x : A → f x ≡ g x~).
- Only in special cases can we say that two functions are /intensionally/ equal
  (~f ≡ g~).
  - Specifically, when both are /actually the same/ (~f ≡ f~) or when one is an
    /abbreviation/ of the other (defined without pattern matching).

