blog/EqualityOfFunctions.html

<div id="outline-container-org1d54ff4" class="outline-2">
<h2 id="Setup"><span class="section-number-2">3</span> Setup</h2>
<div class="outline-text-2" id="text-Setup">
<p>
Here we make use of the following definitions from the standard library.
</p>
<div class="org-src-container">
<pre class="src src-agda2">open import Data.Nat using <span style="color: #51afef;">(</span>&#8469; ; zero ; suc ; _+_<span style="color: #51afef;">)</span>
open import Data.Nat.Properties using <span style="color: #51afef;">(</span>+-identity&#691;<span style="color: #51afef;">)</span>

open import Relation.Nullary using <span style="color: #51afef;">(</span>&#172;_<span style="color: #51afef;">)</span>
import Relation.Binary.PropositionalEquality as Eq
open Eq using <span style="color: #51afef;">(</span>_&#8801;_ ; refl ; sym ; cong<span style="color: #51afef;">)</span>
open Eq.&#8801;-Reasoning using <span style="color: #51afef;">(</span>begin_ ; _&#8801;<span style="color: #C57BDB;">&#10216;&#10217;</span>_ ; _&#8801;<span style="color: #C57BDB;">&#10216;</span>_<span style="color: #C57BDB;">&#10217;</span>_ ; _&#8718;<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
For the purposes of this thought experiment, we will work with
this Agda record.
</p>
<pre class="example">
record PseudoAddition : Set where
  field
    _⊕_ : ℕ → ℕ → ℕ
    z⊕n≡n : (n : ℕ) → zero ⊕ n ≡ n
    [suc-m]⊕n≡suc-[m⊕n] : (m n : ℕ) → (suc m) ⊕ n ≡ suc (m ⊕ n)
</pre>

<p>
We call the record <code>PseudoAddition</code>, since we are claiming that the <code>⊕</code> operator
is, in fact, addition, even though we do not have its definition.
Practically speaking, this means we have as assumptions
the existence of this <code>⊕</code> operator
and the two properties describing its behaviour.
</p>

<p>
We could equivalently have made the fields parameters to this Agda module;
in Agda, records define a module, so there's not much difference.
</p>
</div>
</div>

<div id="outline-container-org942cc88" class="outline-2">
<h2 id="⊕-equals-+…-extensionally"><span class="section-number-2">4</span> ⊕ equals +… extensionally</h2>
<div class="outline-text-2" id="text-⊕-equals-+…-extensionally">
<p>
It's relatively simple to prove that our assumed <code>⊕</code> operator
is extensionally equal to addition, given
the properties <code>zero ⊕ n ≡ n</code> and <code>m ⊕ n ≡ m + n</code>.
Enough so that we leave this as exercise to the reader.
Make use of <code>cong</code> in the induction step; you'll probably need just two steps.
</p>
<div class="org-src-container">
<pre class="src src-agda2">record PseudoAddition : Set where
  field
    _&#8853;_ : &#8469; &#8594; &#8469; &#8594; &#8469;
    z&#8853;n&#8801;n : <span style="color: #51afef;">(</span>n : &#8469;<span style="color: #51afef;">)</span> &#8594; zero &#8853; n &#8801; n
    <span style="color: #51afef;">[</span>suc-m<span style="color: #51afef;">]</span>&#8853;n&#8801;suc-<span style="color: #51afef;">[</span>m&#8853;n<span style="color: #51afef;">]</span> : <span style="color: #51afef;">(</span>m n : &#8469;<span style="color: #51afef;">)</span> &#8594; <span style="color: #51afef;">(</span>suc m<span style="color: #51afef;">)</span> &#8853; n &#8801; suc <span style="color: #51afef;">(</span>m &#8853; n<span style="color: #51afef;">)</span>
</pre>
</div>

<pre class="example">
  m⊕n≡m+n : (m n : ℕ) →  m ⊕ n ≡ m + n
  m⊕n≡m+n zero n = z⊕n≡n n
  m⊕n≡m+n (suc m) n =
    begin
      (suc m ⊕ n)
    ≡⟨ ??? ⟩
      suc (m + n)
    ∎
</pre>
</div>
</div>

<div id="outline-container-org3a6da55" class="outline-2">
<h2 id="An-example"><span class="section-number-2">5</span> An example</h2>
<div class="outline-text-2" id="text-An-example">
<p>
Let's take a short break here to see an actual use of our record;
we can define an operator similar, but not quite equal to addition,
and by providing proofs that it satisfies the two properties
defining plus, the record provides us with a proof that our operator
is extensionally equal to addition.
(Note the
<a href="https://agda.readthedocs.io/en/v2.6.0.1/language/instance-arguments.html#defining-type-classes">connection</a>
between Agda records and Haskell-style typeclasses).
</p>
<div class="org-src-container">
<pre class="src src-agda2">_+&#8320;_ : &#8469; &#8594; &#8469; &#8594; &#8469;
m +&#8320; n = m + n + 0

+&#8320;-is-PseudoAddition : PseudoAddition
+&#8320;-is-PseudoAddition =
  record <span style="color: #51afef;">{</span> _&#8853;_ = _+&#8320;_
         ; z&#8853;n&#8801;n = +-identity&#691;
         ; <span style="color: #C57BDB;">[</span>suc-m<span style="color: #C57BDB;">]</span>&#8853;n&#8801;suc-<span style="color: #C57BDB;">[</span>m&#8853;n<span style="color: #C57BDB;">]</span> = &#955; _ _ &#8594; refl <span style="color: #51afef;">}</span>

m+&#8320;n&#8801;m+n : <span style="color: #51afef;">(</span>m n : &#8469;<span style="color: #51afef;">)</span> &#8594; m +&#8320; n &#8801; m + n
m+&#8320;n&#8801;m+n = PseudoAddition.m&#8853;n&#8801;m+n +&#8320;-is-PseudoAddition
</pre>
</div>
</div>
</div>

<div id="outline-container-orga8ab8f0" class="outline-2">
<h2 id="⊕-does-not-equal-+-intensionally"><span class="section-number-2">6</span> ⊕ does not equal + intensionally</h2>
<div class="outline-text-2" id="text-⊕-does-not-equal-+-intensionally">
<p>
So, we can show prove that our operation is extensionally equal to addition.
However, if we try to prove
</p>
<pre class="example">
  ⊕≡+ : _⊕_ ≡ _+_
  ⊕≡+ = ???
</pre>
<p>
we will find we cannot. (Note we cannot disprove it either).
</p>

<p>
In fact, even if we know the definition of the operator,
and that definition is <i>exactly the same</i> as that of addition, as in
</p>
<div class="org-src-container">
<pre class="src src-agda2">_plus_ : &#8469; &#8594; &#8469; &#8594; &#8469;
zero  plus n = n
suc m plus n = suc <span style="color: #51afef;">(</span>m plus n<span style="color: #51afef;">)</span>
</pre>
</div>
<p>
we <b>still</b> cannot prove it is intensionally equal to addition.
</p>

<p>
<b>Why not!?</b>
</p>

<p>
A <a href="https://lists.chalmers.se/pipermail/agda/2015/007492.html">post</a>
by Peter Selinger on the Agda mailing list sheds some light on the situation.
Specifically, he sums up the situation as
</p>
<blockquote>
<p>
…function equality in Agda is definitional
equality, i.e., two functions are equal if and only if they are
internally represented as pointers to the same closure.
</p>
</blockquote>
</div>

<div id="outline-container-orgc2ac280" class="outline-3">
<h3 id="Well,-actually…"><span class="section-number-3">6.1</span> Well, actually…</h3>
<div class="outline-text-3" id="text-Well,-actually…">
<p>
There is small a gotcha here; this statement applies
to functions <i>defined by pattern matching</i>.
Functions not defined by pattern matching are simply abbreviations,
and those abbreviations are expanded during equality checks.
See the later <a href="https://lists.chalmers.se/pipermail/agda/2015/007497.html">post</a>
in the same thread by Andreas Abel.
</p>

<p>
So, this code will typecheck.
</p>
<div class="org-src-container">
<pre class="src src-agda2">_really-plus_ : &#8469; &#8594; &#8469; &#8594; &#8469;
m really-plus n = m + n

really-plus&#8801;+ : _really-plus_ &#8801; _+_
really-plus&#8801;+ = refl
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd0071a6" class="outline-2">
<h2 id="The-general-case"><span class="section-number-2">7</span> The general case</h2>
<div class="outline-text-2" id="text-The-general-case">
<p>
Given what we've seen above with <code>⊕</code> and addition, we can conclude
this about checking equality of functions in Agda:
</p>
<ul class="org-ul">
<li>We can, given enough information, prove that two functions are
<i>extensionally</i> equal to each other (<code>x : A → f x ≡ g x</code>).</li>
<li>Only in special cases can we say that two functions are <i>intensionally</i> equal
(<code>f ≡ g</code>).
<ul class="org-ul">
<li>Specifically, when both are <i>actually the same</i> (<code>f ≡ f</code>) or when one is an
<i>abbreviation</i> of the other (defined without pattern matching).</li>
</ul></li>
</ul>
</div>
</div>
